nxp-appcodehub/dm-multiple-face-detection-on-mcxn947/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Enables the clock for GPIO1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for INPUTMUX: Enables clock */
    CLOCK_EnableClock(kCLOCK_InputMux0);
    /* Enables the clock for PORT0 controller: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port0);
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);
    /* Enables the clock for PORT2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port2);
    /* Enables the clock for PORT3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port3);
    CLOCK_EnableClock(kCLOCK_Port4);

    CLOCK_EnableClock(kCLOCK_Gpio0);
    CLOCK_EnableClock(kCLOCK_Gpio1);
    CLOCK_EnableClock(kCLOCK_Gpio2);
    CLOCK_EnableClock(kCLOCK_Gpio3);
    CLOCK_EnableClock(kCLOCK_Gpio4);
#ifdef USE_BOARD_BRK
	/* PORT3_20 (pin A4) is configured as PIO3_20 debug port*/
	PORT_SetPinMux(PORT3, 20U, kPORT_MuxAlt3);

	PORT3->PCR[20] = ((PORT3->PCR[20] &
					  /* Mask bits to zero which are setting */
					  (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

					 /* Slew Rate Enable: Fast. */
					 | PORT_PCR_SRE(PCR_SRE_sre0)

					 /* Input Buffer Enable: Enables. */
					 | PORT_PCR_IBE(PCR_IBE_ibe1));
	/* PORT3_20 (pin A4) is configured as PIO3_21 debug port*/
	PORT_SetPinMux(PORT3, 21U, kPORT_MuxAlt3);

	PORT3->PCR[21] = ((PORT3->PCR[21] &
					  /* Mask bits to zero which are setting */
					  (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

					 /* Slew Rate Enable: Fast. */
					 | PORT_PCR_SRE(PCR_SRE_sre0)

					 /* Input Buffer Enable: Enables. */
					 | PORT_PCR_IBE(PCR_IBE_ibe1));


	gpio_pin_config_t gpio1_pinG4_config = {
	        .pinDirection = kGPIO_DigitalOutput,
	        .outputLogic = 0U
	    };
	/* Initialize GPIO functionality on pin PIO1_18 (pin G4) CAM PWdown */
	GPIO_PinInit(GPIO1, 18U, &gpio1_pinG4_config);

	gpio_pin_config_t gpio1_pinG5_config = {
	        .pinDirection = kGPIO_DigitalOutput,
	        .outputLogic = 1U
	    };
	    /* Initialize GPIO functionality on pin PIO1_19 (pin G5)  CAM rst*/
	GPIO_PinInit(GPIO1, 19U, &gpio1_pinG5_config);

	/* P0_4 is selected for SMARTDMA arch B 0  CAM VSync*/
	INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_GpioPort0Pin10ToSmartDma);
	/* P0_11 is selected for SMARTDMA arch B 1 CAM HSync*/
	INPUTMUX_AttachSignal(INPUTMUX0, 1U, kINPUTMUX_GpioPort0Pin11ToSmartDma);
	/* P0_5 is selected for SMARTDMA arch B 2 CAM PCLK*/
	INPUTMUX_AttachSignal(INPUTMUX0, 2U, kINPUTMUX_GpioPort0Pin14ToSmartDma);

	/* PORT0_16  is configured as FC7_P0 I2C SDA*/
	PORT_SetPinMux(PORT0, 16U, kPORT_MuxAlt2);

	PORT0->PCR[16] = ((PORT0->PCR[16] &
					/* Mask bits to zero which are setting */
					(~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_IBE_MASK)))

				   /* Pull Select: Enables internal pullup resistor. */
				   | PORT_PCR_PS(PCR_PS_ps1)

				   /* Pull Enable: Enables. */
				   | PORT_PCR_PE(PCR_PE_pe1)

				   /* Input Buffer Enable: Enables. */
				   | PORT_PCR_IBE(PCR_IBE_ibe1));

	  /* PORT0_17 (pin D16) is configured as FC7_P1 I2C SCL*/
	  PORT_SetPinMux(PORT0, 17U, kPORT_MuxAlt2);

	  PORT0->PCR[17] = ((PORT0->PCR[17] &
						/* Mask bits to zero which are setting */
						(~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_IBE_MASK)))

					   /* Pull Select: Enables internal pullup resistor. */
					   | PORT_PCR_PS(PCR_PS_ps1)

					   /* Pull Enable: Enables. */
					   | PORT_PCR_PE(PCR_PE_pe1)

					   /* Input Buffer Enable: Enables. */
					   | PORT_PCR_IBE(PCR_IBE_ibe1));

	  /* PORT0_11 (pin B11) is configured as PIO0_11 CAM HSync*/
	      PORT_SetPinMux(PORT0, 11U, kPORT_MuxAlt0);

	      PORT0->PCR[11] = ((PORT0->PCR[11] &
	                         /* Mask bits to zero which are setting */
	                         (~(PORT_PCR_IBE_MASK)))

	                        /* Input Buffer Enable: Enables. */
	                        | PORT_PCR_IBE(PCR_IBE_ibe1));

	      /* PORT0_10 (pin B14) is configured as PIO0_4 CAM VSYNC*/
	      PORT_SetPinMux(PORT0, 10U, kPORT_MuxAlt0);

	      PORT0->PCR[10] = ((PORT0->PCR[10] &
	                        /* Mask bits to zero which are setting */
	                        (~(PORT_PCR_IBE_MASK)))

	                       /* Input Buffer Enable: Enables. */
	                       | PORT_PCR_IBE(PCR_IBE_ibe1));

	      /* PORT0_14 (pin A14) is configured as PIO0_5 CAM PCLK*/
	      PORT_SetPinMux(PORT0, 14U, kPORT_MuxAlt0);

	      PORT0->PCR[14] = ((PORT0->PCR[14] &
	                        /* Mask bits to zero which are setting */
	                        (~(PORT_PCR_IBE_MASK)))

	                       /* Input Buffer Enable: Enables. */
	                       | PORT_PCR_IBE(PCR_IBE_ibe1));
	      /* PORT2_2 (pin H3) is configured as CLKOUT CAM CLKIn */
		   PORT_SetPinMux(PORT2, 2U, kPORT_MuxAsGpio);

		   PORT2->PCR[2] = ((PORT2->PCR[2] &
							 /* Mask bits to zero which are setting */
							 (~(PORT_PCR_IBE_MASK)))

							/* Input Buffer Enable: Enables. */
							| PORT_PCR_IBE(PCR_IBE_ibe1));

		   /* PORT0_6 (pin H3) is configured as CLKOUT CAM CLKIn */
		   PORT_SetPinMux(PORT0, 6U, kPORT_MuxAlt12);

		   PORT0->PCR[6] = ((PORT0->PCR[6] &
							 /* Mask bits to zero which are setting */
							 (~(PORT_PCR_IBE_MASK)))

							/* Input Buffer Enable: Enables. */
							| PORT_PCR_IBE(PCR_IBE_ibe1));

	       /* PORT1_4 (pin A4) is configured as PIO1_4  CAM D0*/
	       PORT_SetPinMux(PORT1, 4U, kPORT_MuxAlt7);

	       PORT1->PCR[4] = ((PORT1->PCR[4] &
						     /* Mask bits to zero which are setting */
						     (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

						    /* Slew Rate Enable: Fast. */
						    | PORT_PCR_SRE(PCR_SRE_sre0)

						    /* Input Buffer Enable: Enables. */
						    | PORT_PCR_IBE(PCR_IBE_ibe1));
	       /* PORT1_5 (pin A4) is configured as PIO1_4  CAM D1*/
	       PORT_SetPinMux(PORT1, 5U, kPORT_MuxAlt7);

