nxp-appcodehub/dm-multiple-face-detection-on-mcxn947/board/pin_mux.c
	       PORT1->PCR[5] = ((PORT1->PCR[5] &
						     /* Mask bits to zero which are setting */
						     (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

						    /* Slew Rate Enable: Fast. */
						    | PORT_PCR_SRE(PCR_SRE_sre0)

						    /* Input Buffer Enable: Enables. */
						    | PORT_PCR_IBE(PCR_IBE_ibe1));
	       /* PORT1_6 (pin A4) is configured as PIO1_4  CAM D2*/
	       PORT_SetPinMux(PORT1, 6U, kPORT_MuxAlt7);

	       PORT1->PCR[6] = ((PORT1->PCR[6] &
						     /* Mask bits to zero which are setting */
						     (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

						    /* Slew Rate Enable: Fast. */
						    | PORT_PCR_SRE(PCR_SRE_sre0)

						    /* Input Buffer Enable: Enables. */
						    | PORT_PCR_IBE(PCR_IBE_ibe1));

	       /* PORT1_7 (pin A4) is configured as PIO1_4  CAM D3*/
	       PORT_SetPinMux(PORT1, 7U, kPORT_MuxAlt7);

	       PORT1->PCR[7] = ((PORT1->PCR[7] &
						     /* Mask bits to zero which are setting */
						     (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

						    /* Slew Rate Enable: Fast. */
						    | PORT_PCR_SRE(PCR_SRE_sre0)

						    /* Input Buffer Enable: Enables. */
						    | PORT_PCR_IBE(PCR_IBE_ibe1));

	       /* PORT1_8 (pin A4) is configured as PIO1_4  CAM D4*/
	       PORT_SetPinMux(PORT1, 8U, kPORT_MuxAlt7);

	       PORT1->PCR[8] = ((PORT1->PCR[8] &
						     /* Mask bits to zero which are setting */
						     (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

						    /* Slew Rate Enable: Fast. */
						    | PORT_PCR_SRE(PCR_SRE_sre0)

						    /* Input Buffer Enable: Enables. */
						    | PORT_PCR_IBE(PCR_IBE_ibe1));

		/* PORT1_9 (pin A4) is configured as PIO1_4  CAM D5*/
	       PORT_SetPinMux(PORT1, 9U, kPORT_MuxAlt7);

	       PORT1->PCR[9] = ((PORT1->PCR[9] &
						     /* Mask bits to zero which are setting */
						     (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

						    /* Slew Rate Enable: Fast. */
						    | PORT_PCR_SRE(PCR_SRE_sre0)

						    /* Input Buffer Enable: Enables. */
						    | PORT_PCR_IBE(PCR_IBE_ibe1));

		/* PORT1_10 (pin A4) is configured as PIO1_10  CAM D6*/
	       PORT_SetPinMux(PORT1, 10U, kPORT_MuxAlt7);

	       PORT1->PCR[10] = ((PORT1->PCR[10] &
						     /* Mask bits to zero which are setting */
						     (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

						    /* Slew Rate Enable: Fast. */
						    | PORT_PCR_SRE(PCR_SRE_sre0)

						    /* Input Buffer Enable: Enables. */
						    | PORT_PCR_IBE(PCR_IBE_ibe1));
		/* PORT1_11 (pin A4) is configured as PIO1_11  CAM D7*/
	       PORT_SetPinMux(PORT1, 11U, kPORT_MuxAlt7);

	       PORT1->PCR[11] = ((PORT1->PCR[11] &
						     /* Mask bits to zero which are setting */
						     (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

						    /* Slew Rate Enable: Fast. */
						    | PORT_PCR_SRE(PCR_SRE_sre0)

						    /* Input Buffer Enable: Enables. */
						    | PORT_PCR_IBE(PCR_IBE_ibe1));

#if SERVO_ENABLE
    //modified by qi
  const port_pin_config_t port1_22_pinL4_config = {/* Internal pull-up/down resistor is disabled */
                                                        kPORT_PullDisable,
                                                        /* Low internal pull resistor value is selected. */
                                                        kPORT_LowPullResistor,
                                                        /* Fast slew rate is configured */
                                                        kPORT_FastSlewRate,
                                                        /* Passive input filter is disabled */
                                                        kPORT_PassiveFilterDisable,
                                                        /* Open drain output is disabled */
                                                        kPORT_OpenDrainDisable,
                                                        /* Low drive strength is configured */
                                                        kPORT_LowDriveStrength,
                                                        /* Pin is configured as SCT0_OUT4 */
                                                        kPORT_MuxAlt5,
                                                        /* Digital input enabled */
                                                        kPORT_InputBufferEnable,
                                                        /* Digital input is not inverted */
                                                        kPORT_InputNormal,
                                                        /* Pin Control Register fields [15:0] are not locked */
                                                        kPORT_UnlockRegister};
      /* PORT1_22 (pin L4) is configured as SCT0_OUT4 */
      PORT_SetPinConfig(PORT1, 22U, &port1_22_pinL4_config);

      const port_pin_config_t port1_23_pinM4_config = {/* Internal pull-up/down resistor is disabled */
                                                        kPORT_PullDisable,
                                                        /* Low internal pull resistor value is selected. */
                                                        kPORT_LowPullResistor,
                                                        /* Fast slew rate is configured */
                                                        kPORT_FastSlewRate,
                                                        /* Passive input filter is disabled */
                                                        kPORT_PassiveFilterDisable,
                                                        /* Open drain output is disabled */
                                                        kPORT_OpenDrainDisable,
                                                        /* Low drive strength is configured */
                                                        kPORT_LowDriveStrength,
                                                        /* Pin is configured as SCT0_OUT5 */
                                                        kPORT_MuxAlt5,
                                                        /* Digital input enabled */
                                                        kPORT_InputBufferEnable,
                                                        /* Digital input is not inverted */
                                                        kPORT_InputNormal,
                                                        /* Pin Control Register fields [15:0] are not locked */
                                                        kPORT_UnlockRegister};
      /* PORT1_23 (pin M4) is configured as SCT0_OUT5 */
      PORT_SetPinConfig(PORT1, 23U, &port1_23_pinM4_config);
#endif

#else
    gpio_pin_config_t gpio1_pinG4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_18 (pin G4) CAM PWdown */
    GPIO_PinInit(GPIO1, 18U, &gpio1_pinG4_config);

    gpio_pin_config_t gpio1_pinG5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_19 (pin G5)  CAM rst*/
    GPIO_PinInit(GPIO1, 19U, &gpio1_pinG5_config);

    /* P0_4 is selected for SMARTDMA arch B 0  CAM VSync*/
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_GpioPort0Pin4ToSmartDma);
    /* P0_11 is selected for SMARTDMA arch B 1 CAM HSync*/
    INPUTMUX_AttachSignal(INPUTMUX0, 1U, kINPUTMUX_GpioPort0Pin11ToSmartDma);
    /* P0_5 is selected for SMARTDMA arch B 2 CAM PCLK*/
    INPUTMUX_AttachSignal(INPUTMUX0, 2U, kINPUTMUX_GpioPort0Pin5ToSmartDma);

