nxp-appcodehub/dm-multiple-face-detection-on-mcxn947/board/pin_mux.c
    /* PORT3_2 (pin D15) is configured as FC7_P0 I2C SDA*/
	PORT_SetPinMux(PORT3, 2U, kPORT_MuxAlt2);

	PORT3->PCR[2] = ((PORT3->PCR[2] &
					/* Mask bits to zero which are setting */
					(~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_IBE_MASK)))

				   /* Pull Select: Enables internal pullup resistor. */
				   | PORT_PCR_PS(PCR_PS_ps1)

				   /* Pull Enable: Enables. */
				   | PORT_PCR_PE(PCR_PE_pe1)

				   /* Input Buffer Enable: Enables. */
				   | PORT_PCR_IBE(PCR_IBE_ibe1));

	  /* PORT3_3 (pin D16) is configured as FC7_P1 I2C SCL*/
	  PORT_SetPinMux(PORT3, 3U, kPORT_MuxAlt2);

	  PORT3->PCR[3] = ((PORT3->PCR[3] &
						/* Mask bits to zero which are setting */
						(~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_IBE_MASK)))

					   /* Pull Select: Enables internal pullup resistor. */
					   | PORT_PCR_PS(PCR_PS_ps1)

					   /* Pull Enable: Enables. */
					   | PORT_PCR_PE(PCR_PE_pe1)

					   /* Input Buffer Enable: Enables. */
					   | PORT_PCR_IBE(PCR_IBE_ibe1));

	  /* PORT3_18 (pin K16) is configured as PIO3_18 */
		PORT_SetPinMux(PORT3, 18U, kPORT_MuxAlt7);

		PORT3->PCR[18] = ((PORT3->PCR[18] &
						   /* Mask bits to zero which are setting */
						   (~(PORT_PCR_IBE_MASK)))

						  /* Input Buffer Enable: Enables. */
						  | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_11 (pin B11) is configured as PIO0_11 CAM HSync*/
    PORT_SetPinMux(PORT0, 11U, kPORT_MuxAlt0);

    PORT0->PCR[11] = ((PORT0->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_4 (pin B14) is configured as PIO0_4 CAM VSYNC*/
    PORT_SetPinMux(PORT0, 4U, kPORT_MuxAlt0);

    PORT0->PCR[4] = ((PORT0->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_5 (pin A14) is configured as PIO0_5 CAM PCLK*/
    PORT_SetPinMux(PORT0, 5U, kPORT_MuxAlt0);

    PORT0->PCR[5] = ((PORT0->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_16 (pin B10) is configured as FC0_P0 */
    PORT_SetPinMux(PORT0, 16U, kPORT_MuxAlt2);

    PORT0->PCR[16] = ((PORT0->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_IBE_MASK)))

                      /* Open Drain Enable: Enables. */
                      | PORT_PCR_ODE(PCR_ODE_ode1)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_17 (pin A10) is configured as FC0_P1 */
    PORT_SetPinMux(PORT0, 17U, kPORT_MuxAlt2);

    PORT0->PCR[17] = ((PORT0->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_IBE_MASK)))

                      /* Open Drain Enable: Enables. */
                      | PORT_PCR_ODE(PCR_ODE_ode1)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_6 (pin C14) is configured as clkout */
    //PORT_SetPinMux(PORT0, 6U, kPORT_MuxAlt12);

    //PORT0->PCR[6] = ((PORT0->PCR[6] &
                      /* Mask bits to zero which are setting */
      //                (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
        //             | PORT_PCR_IBE(PCR_IBE_ibe1));
    /* PORT2_2 (pin H3) is configured as CLKOUT CAM CLKIn */
     PORT_SetPinMux(PORT2, 2U, kPORT_MuxAlt1);

     PORT2->PCR[2] = ((PORT2->PCR[2] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));
    /* PORT1_10 (pin C3) is configured as PIO1_10 CAM D6 */
    PORT_SetPinMux(PORT1, 10U, kPORT_MuxAlt7);

    PORT1->PCR[10] = ((PORT1->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

                      /* Slew Rate Enable: Fast. */
                      | PORT_PCR_SRE(PCR_SRE_sre0)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_11 (pin D3) is configured as PIO1_11 CAM D7 */
    PORT_SetPinMux(PORT1, 11U, kPORT_MuxAlt7);

    PORT1->PCR[11] = ((PORT1->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

                      /* Slew Rate Enable: Fast. */
                      | PORT_PCR_SRE(PCR_SRE_sre0)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));


    /* PORT1_4 (pin A4) is configured as PIO1_4  CAM D0*/
    PORT_SetPinMux(PORT1, 4U, kPORT_MuxAlt7);

    PORT1->PCR[4] = ((PORT1->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

                     /* Slew Rate Enable: Fast. */
                     | PORT_PCR_SRE(PCR_SRE_sre0)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_5 (pin B3) is configured as PIO1_5 CAM D1*/
    PORT_SetPinMux(PORT1, 5U, kPORT_MuxAlt7);

    PORT1->PCR[5] = ((PORT1->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_SRE_MASK | PORT_PCR_IBE_MASK)))

                     /* Slew Rate Enable: Fast. */
                     | PORT_PCR_SRE(PCR_SRE_sre0)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

